БПКР/src/InformationRegisters/ИсключенияПрайсЛистов/ИсключенияПрайсЛистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсключенияПрайсЛистов</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрайсЛист</name>
    <type>
      <types>CatalogRef.ПрайсЛисты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/ИсключенияПрайсЛистов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьИсключение(Номенклатура, ПрайсЛист) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПрайсЛист) Тогда
		
		Возврат;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Номенклатура) Тогда
					
		Возврат;
					
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ИсключенияПрайсЛистов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура		= Номенклатура;
	МенеджерЗаписи.ПрайсЛист		= ПрайсЛист;
	
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось завершить запись по причине: %1'"), 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
